src/Documents/КАЗ_РеестрПлатежей/КАЗ_РеестрПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_РеестрПлатежей</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <attributes>
    <name>ДатаРеестра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьОплаты</name>
    <type>
      <types>CatalogRef.КАЗ_ОчередиПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРеестра</name>
    <type>
      <types>EnumRef.КАЗ_СтатусыРеестра</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.КАЗ_СтатусыЗаявки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/КАЗ_РеестрПлатежей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаявкиЗаявкаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Заявки.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьДанныеЗаявки(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеЗаявки(СтрокаТЧ)

	ДанныеЗаявки = ПолучитьДанныеЗаявкиНаСервере(СтрокаТЧ.Заявка);

	СтрокаТЧ.Контрагент = ДанныеЗаявки.Контрагент;
	СтрокаТЧ.Сумма = ДанныеЗаявки.Сумма;
	СтрокаТЧ.Статус = ДанныеЗаявки.Статус;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаявкиНаСервере(Заявка)

	Результат = Новый Структура;
	Результат.Вставить("Контрагент", Заявка.Контрагент);
	Результат.Вставить("Сумма", Заявка.СуммаДокумента);
	Результат.Вставить("Статус", Заявка.Статус);

	Возврат Результат;

КонецФункции
